app/views/admin/items/_new.html.erb

             <th><%= f.label :ジャンル %></th>
             <td><%= f.collection_select :genre_id, Genre.all, :id, :name, :prompt => "--選択して下さい--" %></td>
---
SELECT "genres".* FROM "genres"