app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.all.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2023-10-02 15:44:02.545406"], ["id", 3]]