app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genre = Genre.new
    @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2022-01-02 08:08:25.936650"], ["updated_at", "2022-01-02 08:08:25.936650"]]
---
  def create
    @genre =Genre.new(genre_params)
    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "キャンディ"], ["updated_at", "2022-01-03 12:04:06.266032"], ["id", 4]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)