app/controllers/admin/homes_controller.rb

  def top
    if params[:customers_id]
      #遷移してきたIDをwhereで取得
      @orders = order.where(customer_id: params[:customer_id]).page(params[:page]).per(10)
    else
      #オーダーデータ全て
      @orders = Order.all.page(params[:page]).per(10).order(created_at: :desc)
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"