app/controllers/admin/items_controller.rb

   def index
     @items = Item.all.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

   def update
     @item = Item.find(params[:id])
     if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "name" = ?, "image_id" = ?, "introduction" = ?, "genre_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "テスト"], ["image_id", "8a561ac158cfed0e9080383a316fc798e076bb4b5881bb57edd1e51ad864"], ["introduction", "テスト商品"], ["genre_id", 1], ["updated_at", "2022-01-04 10:46:06.075059"], ["id", 2]]

   def new
     @item = Item.new
     @genres = Genre.all
---
SELECT "genres".* FROM "genres"

   def create
     @item = Item.new(item_params)
     if @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)