app/controllers/admin/order_details_controller.rb

SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2023-09-20 07:56:14.994429"], ["id", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 2], ["updated_at", "2023-09-20 07:56:14.986196"], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."making_status" = ?  [["order_id", 1], ["making_status", 3]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2023-09-20 07:58:31.307464"], ["id", 1]]
---
  def update
    @order_detail = OrderDetail.find(params[:id])

    @order_detail.update(order_detail_params)
    @order = @order_detail.order

    #制作ステータスを「制作中（２）」→注文ステータスを「制作中（２）」
    if @order_detail.making_status == "製作中"
      @order.update(status: 2)
      flash[:notice] = "制作ステータスの更新しました。"
      @order.save
    end

    #注文個数と制作完了になっている個数が同じなら
    if @order.order_details.count == @order.order_details.where(making_status: 3).amount
      @order.update(status: 3)
      flash[:notice] = "制作ステータスの更新をしました。"
      @order.save