app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 1], ["updated_at", "2023-09-20 07:55:33.552551"], ["id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2023-09-20 07:55:33.535809"], ["id", 1]]
---
  def update
    @order = Order.find(order_params)
    if @order.order_status == "入金確認"
      @order.order_details.each do |order|
        order_details.update(making_status: 1)