app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
          <th>購入者</th>
          <td><%= link_to "#{@order.customer.last_name} #{@order.customer.first_name}", admin_customer_path(@order.customer.id), class: "text-dark border-bottom border-dark" %></td>