app/views/admin/homes/top.html.erb

             <td><%= link_to "#{order.created_at.strftime('%Y/%m/%d %H:%M:%S')}", admin_order_path(order.id), class: "text-dark border-bottom border-dark" %></td>
             <td><%= order.customer.last_name %><%= order.customer.first_name %></td>
             <td><%= order.order_details.sum(:amount) %></td>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT SUM("order_details"."amount") FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]