app/controllers/public/addresses_controller.rb

  def index
    @addresses = current_customer.addresses.order(created_at: :DESC)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? ORDER BY "addresses"."created_at" DESC  [["customer_id", 6]]

  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save
---
INSERT INTO "addresses" ("postal_code", "address", "name", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["postal_code", "1234567"], ["address", "テスト0-1-2"], ["name", "増田洋輔"], ["customer_id", 6], ["created_at", "2023-09-20 07:48:20.416143"], ["updated_at", "2023-09-20 07:48:20.416143"]]