app/controllers/public/cart_items_controller.rb

  def create
  @cart_item = CartItem.new(params_cart_item)
  @cart_item.customer_id=current_customer.id
  @cart_items=current_customer.cart_items.all
    @cart_items.each do |cart_item|
      if cart_item.item_id==@cart_item.item_id
      new_amount = cart_item.amount + @cart_item.amount
      cart_item.update_attribute(:amount, new_amount)
      @cart_item.delete
      end
    end

    @cart_item.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
INSERT INTO "cart_items" ("amount", "customer_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 3], ["customer_id", 6], ["item_id", 1], ["created_at", "2023-09-20 07:49:16.533621"], ["updated_at", "2023-09-20 07:49:16.533621"]]

  def index
   @cart_items= current_customer.cart_items.all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]

  def update
    @cart_item = CartItem.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy_all
    @cart_items=current_customer.cart_items
    @cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]