app/controllers/public/customers_controller.rb

UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "増"], ["first_name", "洋"], ["last_name_kana", "マス"], ["first_name_kana", "ヨウ"], ["updated_at", "2023-09-24 05:02:07.958038"], ["id", 10]]
---
  def update
    @customer = current_customer
    if @customer.update(customer_params)

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2023-09-20 07:20:48.448595"], ["id", 4]]
---
  def withdraw
    @customer = current_customer
    @customer.update(is_active: false)