app/controllers/public/items_controller.rb

  def index
    @items = Item.all.page(params[:page]).per(8)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]