app/controllers/public/orders_controller.rb

    def index
        #最新の注文から並べるために.reverse_orderを使用している
        @orders = current_customer.orders.page(params[:page]).per(8).reverse_order
---
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["customer_id", 6], ["LIMIT", 8], ["OFFSET", 0]]

    def new
        @cart_items = current_customer.cart_items
        if @cart_items.blank?
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]

    def confirm
        @cart_items = current_customer.cart_items
        @order = Order.new(order_params)
        @order.shipping_cost = 800
        @order.payment_method = params[:order][:payment_method]

        #ラジオボタンで選択した時の取得する情報の条件分岐、enumではなくnew.html.erbで0,1,2を振り分けている
        if params[:order][:address_num] == "0"
            @order.postal_code = current_customer.postal_code
            @order.address = current_customer.address
            @order.name = current_customer.last_name + current_customer.first_name
        elsif params[:order][:address_num] == "1"
            #f.selectのaddress_boxの中の/:id の番号を取得する
            @address = Address.find(params[:order][:address_box])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        @order = Order.find(params[:id])
        @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]

    def create
        #order_paramsで取得できる情報の保存
        order = Order.new(order_params)
        order.status = 0
        order.customer_id = current_customer.id
        order.save

        #商品情報の保存
        cart_items = current_customer.cart_items
        cart_items.each do |cart_item|
            order_detail = OrderDetail.new
            order_detail.order_id = order.id
            order_detail.item_id = cart_item.item.id
            order_detail.amount = cart_item.amount
            order_detail.price = cart_item.subtotal
            order_detail.save
        end

        current_customer.cart_items.destroy_all


        unless Customer.where(id: order.customer_id).where(postal_code: order.postal_code).where(address: order.address) || Address.where(customer_id: order.customer_id).where(name: order.name).where(postal_code: order.postal_code).where(address: order.address).exits?
---
INSERT INTO "orders" ("customer_id", "total_payment", "postal_code", "name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
INSERT INTO "order_details" ("order_id", "item_id", "amount", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["item_id", 1], ["amount", 3], ["price", 1650], ["created_at", "2023-09-20 07:52:55.287985"], ["updated_at", "2023-09-20 07:52:55.287985"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]