app/views/public/orders/confirm.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <h5 class="font-weight-bold">お届け先　　</h5>
              <span>〒</span><%= current_customer.postal_code.to_s.insert(3,"-") %><br><%= current_customer.address %><br><%= current_customer.last_name %>&nbsp;<%= current_customer.first_name %>